In [1]:
import numpy as np
from datascience import *

# Group

In [4]:
sky = Table.read_table('skyscrapers_v2.csv')
sky = (sky.with_column('age', 2020 - sky.column('completed'))
          .drop('completed'))
sky.show(15)

#### 1. How many towers are in each city?

In [13]:
sky.group("city")

city       | count
Atlanta    | 38
Austin     | 17
Baltimore  | 14
Boston     | 32
Charlotte  | 12
Chicago    | 358
Cincinnati | 13
Cleveland  | 16
Columbus   | 13
Dallas     | 20
... (25 rows omitted)

In [17]:
sky.group('city', max).select('city','height max')

city       | height max
Atlanta    | 311.8
Austin     | 208.15
Baltimore  | 161.24
Boston     | 240.79
Charlotte  | 265.48
Chicago    | 442.14
Cincinnati | 202.69
Cleveland  | 288.65
Columbus   | 169.3
Dallas     | 280.72
... (25 rows omitted)

In [ ]:
# skip

In [ ]:
#skip

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
sky.group('city')

#### 2. For each city, what’s the tallest building?

In [8]:
sky.group('height')

height | count
43.89  | 1
44.5   | 2
44.81  | 1
46     | 1
47.4   | 1
48.2   | 1
49.07  | 1
49.38  | 1
50     | 1
51.1   | 1
... (1034 rows omitted)

In [ ]:
# skip

In [ ]:
#skip

In [ ]:
#skip

In [ ]:
#skip

In [ ]:
#skip

In [ ]:
#skip

In [ ]:
#skip
sky.group('city', max)

In [18]:
sky

name                              | material        | city          | height | age
One World Trade Center            | mixed/composite | New York City | 541.3  | 6
Willis Tower                      | steel           | Chicago       | 442.14 | 46
432 Park Avenue                   | concrete        | New York City | 425.5  | 5
Trump International Hotel & Tower | concrete        | Chicago       | 423.22 | 11
Empire State Building             | steel           | New York City | 381    | 89
Bank of America Tower             | mixed/composite | New York City | 365.8  | 11
Stratosphere Tower                | concrete        | Las Vegas     | 350.22 | 24
Aon Center                        | steel           | Chicago       | 346.26 | 47
John Hancock Center               | steel           | Chicago       | 343.69 | 51
Chrysler Building                 | steel           | New York City | 318.9  | 90
... (1771 rows omitted)

In [19]:
## how many different materials can a building be made off?

In [20]:
sky.group('material')

material        | count
concrete        | 947
mixed/composite | 124
steel           | 710

In [21]:
####H ow many building in each city are built of each material

In [22]:
sky.group(['city', 'material'])

/opt/conda/lib/python3.8/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray.
  values = np.array(tuple(values))

city      | material        | count
Atlanta   | concrete        | 27
Atlanta   | mixed/composite | 4
Atlanta   | steel           | 7
Austin    | concrete        | 16
Austin    | steel           | 1
Baltimore | concrete        | 8
Baltimore | steel           | 6
Boston    | concrete        | 4
Boston    | mixed/composite | 2
Boston    | steel           | 26
... (81 rows omitted)

#### 3. For each city, what’s the tallest building for each material?
(back to slides after asking this question)

In [24]:
sky.group(['city', 'material'], max)

city      | material        | name max                                | height max | age max
Atlanta   | concrete        | Westin Peachtree Plaza                  | 264.25     | 44
Atlanta   | mixed/composite | Two Alliance Center                     | 311.8      | 33
Atlanta   | steel           | State of Georgia Building               | 169.47     | 123
Austin    | concrete        | Windsor on the Lake                     | 208.15     | 36
Austin    | steel           | University of Texas Tower               | 93.6       | 83
Baltimore | concrete        | The John and Frances Angelos Law Center | 161.24     | 53
Baltimore | steel           | Mercy Medical Center Inpatient Tower    | 155.15     | 109
Boston    | concrete        | Harbor Towers II                        | 121.92     | 49
Boston    | mixed/composite | Ellison Building                        | 139        | 28
Boston    | steel           | Two International Place                 | 240.79     | 105
... (81 rows omitted)

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
#skip

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
sky.group(['city', 'material'], max)

#### 4. For each city, whats the combined hiehgt of all the buildings?

In [ ]:
# skip

In [25]:
sky.group('city', sum)

city       | name sum | material sum | height sum | age sum
Atlanta    |          |              | 5720.79    | 1015
Austin     |          |              | 2137.03    | 299
Baltimore  |          |              | 1567.78    | 596
Boston     |          |              | 4394.79    | 1282
Charlotte  |          |              | 1902.82    | 303
Chicago    |          |              | 47257      | 14500
Cincinnati |          |              | 1563.67    | 678
Cleveland  |          |              | 2238.02    | 797
Columbus   |          |              | 1399.42    | 548
Dallas     |          |              | 3363.54    | 791
... (25 rows omitted)

#### 4. For each city, whats the combined hiehgt of all the buildings for the different materials?

In [ ]:
# skip

In [27]:
sky.group(['city', 'material'], sum)

city      | material        | name sum | height sum | age sum
Atlanta   | concrete        |          | 4016.93    | 485
Atlanta   | mixed/composite |          | 916.96     | 100
Atlanta   | steel           |          | 786.9      | 430
Austin    | concrete        |          | 2043.43    | 216
Austin    | steel           |          | 93.6       | 83
Baltimore | concrete        |          | 902.66     | 227
Baltimore | steel           |          | 665.12     | 369
Boston    | concrete        |          | 423.06     | 151
Boston    | mixed/composite |          | 243.2      | 37
Boston    | steel           |          | 3728.53    | 1094
... (81 rows omitted)

In [30]:
sky.drop('age', 'name').group(['material', 'city'])

material | city       | count
concrete | Atlanta    | 27
concrete | Austin     | 16
concrete | Baltimore  | 8
concrete | Boston     | 4
concrete | Charlotte  | 5
concrete | Chicago    | 244
concrete | Cincinnati | 5
concrete | Cleveland  | 2
concrete | Columbus   | 4
concrete | Dallas     | 7
... (81 rows omitted)

In [31]:
sky.drop('age', 'name').group(['city', 'material'])

city      | material        | count
Atlanta   | concrete        | 27
Atlanta   | mixed/composite | 4
Atlanta   | steel           | 7
Austin    | concrete        | 16
Austin    | steel           | 1
Baltimore | concrete        | 8
Baltimore | steel           | 6
Boston    | concrete        | 4
Boston    | mixed/composite | 2
Boston    | steel           | 26
... (81 rows omitted)

In [35]:
sky.select('city')

city
New York City
Chicago
New York City
Chicago
New York City
New York City
Las Vegas
Chicago
Chicago
New York City
... (1771 rows omitted)

In [37]:
sky.select(2)

city
New York City
Chicago
New York City
Chicago
New York City
New York City
Las Vegas
Chicago
Chicago
New York City
... (1771 rows omitted)

In [38]:
sky.drop('age', 'name').group([1, 2])

/opt/conda/lib/python3.8/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray.
  values = np.array(tuple(values))

city    | height | count
Atlanta | 48.2   | 1
Atlanta | 80     | 1
Atlanta | 91     | 1
Atlanta | 94.28  | 1
Atlanta | 100.9  | 1
Atlanta | 102    | 1
Atlanta | 102.41 | 1
Atlanta | 112.65 | 1
Atlanta | 113.08 | 1
Atlanta | 114.9  | 1
... (1521 rows omitted)

In [ ]:
sky.drop('age').group(['city', 'material'], max)

In [ ]:
sky.drop('age').group(['city', 'material'], sum)

In [ ]:
# whats the average height of each otwerin each city broken down by material

In [41]:
sky.drop('age').group(['city', 'material'], np.mean)

city      | material        | name mean | height mean
Atlanta   | concrete        |           | 148.775
Atlanta   | mixed/composite |           | 229.24
Atlanta   | steel           |           | 112.414
Austin    | concrete        |           | 127.714
Austin    | steel           |           | 93.6
Baltimore | concrete        |           | 112.833
Baltimore | steel           |           | 110.853
Boston    | concrete        |           | 105.765
Boston    | mixed/composite |           | 121.6
Boston    | steel           |           | 143.405
... (81 rows omitted)

(back to slides)
# Pivot

In [42]:
sky = Table.read_table('skyscrapers_v2.csv')
sky = (sky.with_column('age', 2020 - sky.column('completed'))
          .drop('completed'))
sky.drop('height', 'age').where('city', are.not_equal_to('New York City')).where('city', are.not_equal_to('Las Vegas')).show(10)

In [44]:
sky.drop('age').group(['city', 'material'])

city      | material        | count
Atlanta   | concrete        | 27
Atlanta   | mixed/composite | 4
Atlanta   | steel           | 7
Austin    | concrete        | 16
Austin    | steel           | 1
Baltimore | concrete        | 8
Baltimore | steel           | 6
Boston    | concrete        | 4
Boston    | mixed/composite | 2
Boston    | steel           | 26
... (81 rows omitted)

#### 1. In every city, how many towers are there of each material?

In [43]:
sky.pivot('material', 'city')

city       | concrete | mixed/composite | steel
Atlanta    | 27       | 4               | 7
Austin     | 16       | 0               | 1
Baltimore  | 8        | 0               | 6
Boston     | 4        | 2               | 26
Charlotte  | 5        | 3               | 4
Chicago    | 244      | 35              | 79
Cincinnati | 5        | 1               | 7
Cleveland  | 2        | 3               | 11
Columbus   | 4        | 0               | 9
Dallas     | 7        | 2               | 11
... (25 rows omitted)

#### What just happened?
(back to slides)

In [45]:
sky.pivot('material', 'city').show(5)

In [46]:
sky.pivot('material', 'city').num_rows

35

In [ ]:
#sky.pivot('city', 'material').show(5)

What happens if you run `group()` with these two columns?

*Remember when grouping on multiple columns, we need to pass in a list of column names*

In [47]:
sky.pivot('material', 'city').show(5)

In [48]:
sky.group(['material', 'city']).show(5)

In [49]:
sky.group(['city', 'material']).show(5)

Let's find the skyscrapers only with steel?

In [50]:
sky.group(['material', 'city']).where('material', are.equal_to('steel')).drop('material')

city       | count
Atlanta    | 7
Austin     | 1
Baltimore  | 6
Boston     | 26
Charlotte  | 4
Chicago    | 79
Cincinnati | 7
Cleveland  | 11
Columbus   | 9
Dallas     | 11
... (23 rows omitted)

### Let's find the average height of towers in each city by each material

`tbl.pivot(col1, col2, values, collect)`

In [ ]:
sky.pivot('material', 'city')
sky.labels

In [51]:
sky.pivot('material', 'city', 'height', np.average)

city       | concrete | mixed/composite | steel
Atlanta    | 148.775  | 229.24          | 112.414
Austin     | 127.714  | 0               | 93.6
Baltimore  | 112.833  | 0               | 110.853
Boston     | 105.765  | 121.6           | 143.405
Charlotte  | 161.348  | 196.01          | 127.013
Chicago    | 128.285  | 160.217         | 130.985
Cincinnati | 102.808  | 202.69          | 120.991
Cleveland  | 116.755  | 166.363         | 136.856
Columbus   | 77.825   | 0               | 120.902
Dallas     | 125.19   | 260.3           | 178.783
... (25 rows omitted)

### Let's find the max height of towers in each city by each material

In [ ]:
sky.pivot('material', 'city', 'height', max)

In [ ]:
def max_min_difference(column):
    """
    Find the difference between the maximum value and minimum value of a column
    """
    return max(column) - min(column)

In [ ]:
np.arange(1,100)
max(np.arange(1, 100)) - min(np.arange(1,100)), max_min_difference(np.arange(1,100))

In [ ]:
type(max_min_difference)

In [ ]:
sky.pivot('material', 'city', 'height', max_min_difference)

In [ ]:
atlanta_heights = sky.where('city', 'Atlanta').where('material', 'concrete').column('height')
max(atlanta_heights) - min(atlanta_heights)

In [ ]:
sky.group(['city', 'material']).where('city', 'Austin')

In [ ]:
sky.pivot('city', 'material')

(back to slides)
# Join

In [52]:
billionaires = Table.read_table('billionaires.csv')
billionaires.show(10)

countries = Table.read_table('countries.csv')
countries.show(10)

### What can we join these two tables on?
In other words, which columns will have similar values?

In [ ]:
# answer below

In [54]:
billionaires.join("citizenship", countries, 'Country')

citizenship | name                | net worth   | industry        | Continent
Australia   | Gina Rinehart       | 19984845036 | Commodities     | Oceania
Australia   | Andrew Forrest      | 10221458789 | Commodities     | Oceania
Australia   | Harry Triguboff     | 9467000000  | Real Estate     | Oceania
Australia   | Scott Farquhar      | 9335988154  | Technology      | Oceania
Australia   | Mike Cannon-Brookes | 9335988154  | Technology      | Oceania
Australia   | Frank Lowy          | 6655432824  | Real Estate     | Oceania
Australia   | Anthony Pratt       | 6566000000  | Industrial      | Oceania
Austria     | Dietrich Mateschitz | 12251315379 | Food & Beverage | Europe
Austria     | Johann Graf         | 6509183360  | Entertainment   | Europe
Brazil      | Jorge Paulo Lemann  | 23056345424 | Food & Beverage | South America
... (490 rows omitted)

In [55]:
#tblA.join(colA, tblB, colB)
billionaires.join('citizenship', countries, 'Country')

citizenship | name                | net worth   | industry        | Continent
Australia   | Gina Rinehart       | 19984845036 | Commodities     | Oceania
Australia   | Andrew Forrest      | 10221458789 | Commodities     | Oceania
Australia   | Harry Triguboff     | 9467000000  | Real Estate     | Oceania
Australia   | Scott Farquhar      | 9335988154  | Technology      | Oceania
Australia   | Mike Cannon-Brookes | 9335988154  | Technology      | Oceania
Australia   | Frank Lowy          | 6655432824  | Real Estate     | Oceania
Australia   | Anthony Pratt       | 6566000000  | Industrial      | Oceania
Austria     | Dietrich Mateschitz | 12251315379 | Food & Beverage | Europe
Austria     | Johann Graf         | 6509183360  | Entertainment   | Europe
Brazil      | Jorge Paulo Lemann  | 23056345424 | Food & Beverage | South America
... (490 rows omitted)

In [56]:
billionaires.num_rows, countries.num_rows, billionaires.join('citizenship', countries, 'Country').num_rows

(500, 198, 500)

In [61]:
billionaires.join('citizenship', countries, 'Country')

citizenship | name                | net worth   | industry        | Continent
Australia   | Gina Rinehart       | 19984845036 | Commodities     | Oceania
Australia   | Andrew Forrest      | 10221458789 | Commodities     | Oceania
Australia   | Harry Triguboff     | 9467000000  | Real Estate     | Oceania
Australia   | Scott Farquhar      | 9335988154  | Technology      | Oceania
Australia   | Mike Cannon-Brookes | 9335988154  | Technology      | Oceania
Australia   | Frank Lowy          | 6655432824  | Real Estate     | Oceania
Australia   | Anthony Pratt       | 6566000000  | Industrial      | Oceania
Austria     | Dietrich Mateschitz | 12251315379 | Food & Beverage | Europe
Austria     | Johann Graf         | 6509183360  | Entertainment   | Europe
Brazil      | Jorge Paulo Lemann  | 23056345424 | Food & Beverage | South America
... (490 rows omitted)

In [59]:
countries.join('Country', billionaires, 'citizenship')

Country   | Continent     | name                | net worth   | industry
Australia | Oceania       | Gina Rinehart       | 19984845036 | Commodities
Australia | Oceania       | Andrew Forrest      | 10221458789 | Commodities
Australia | Oceania       | Harry Triguboff     | 9467000000  | Real Estate
Australia | Oceania       | Scott Farquhar      | 9335988154  | Technology
Australia | Oceania       | Mike Cannon-Brookes | 9335988154  | Technology
Australia | Oceania       | Frank Lowy          | 6655432824  | Real Estate
Australia | Oceania       | Anthony Pratt       | 6566000000  | Industrial
Austria   | Europe        | Dietrich Mateschitz | 12251315379 | Food & Beverage
Austria   | Europe        | Johann Graf         | 6509183360  | Entertainment
Brazil    | South America | Jorge Paulo Lemann  | 23056345424 | Food & Beverage
... (490 rows omitted)

In [62]:
countries.join('citizenship', billionaires, 'Country')

ValueError: label "citizenship" not in labels ('Continent', 'Country')

In [65]:
billionaires.join("name", countries, "Country")

##### How many billionaries are in a specific industry and Continent?

In [ ]:
# answer below

In [68]:
countries.join('Country', billionaires, 'citizenship').pivot('industry', 'Continent')

Continent     | Commodities | Consumer | Diversified | Energy | Entertainment | Finance | Food & Beverage | Health Care | Industrial | Media & Telecom | Real Estate | Retail | Services | Technology
Africa        | 0           | 0        | 2           | 0      | 0             | 0       | 1               | 0           | 2          | 2               | 0           | 0      | 0        | 0
Asia          | 7           | 10       | 27          | 12     | 4             | 4       | 11              | 11          | 21         | 3               | 23          | 8      | 6        | 21
Europe        | 1           | 17       | 13          | 1      | 4             | 1       | 9               | 10          | 21         | 4               | 5           | 15     | 4        | 6
North America | 6           | 14       | 10          | 17     | 9             | 29      | 14              | 6           | 4          | 19              | 12          | 17     | 2        | 33
Oceania       | 2           | 0        | 0           | 0      | 0             | 1       | 0               | 0           | 1          | 0               | 2           | 0      | 0        | 2
South America | 2           | 0        | 0           | 0      | 0             | 6       | 4               | 0           | 1          | 0               | 0           | 0      | 0        | 1

In [69]:
countries.join('Country', billionaires, 'citizenship').group(['industry', 'Continent'])

industry    | Continent     | count
Commodities | Asia          | 7
Commodities | Europe        | 1
Commodities | North America | 6
Commodities | Oceania       | 2
Commodities | South America | 2
Consumer    | Asia          | 10
Consumer    | Europe        | 17
Consumer    | North America | 14
Diversified | Africa        | 2
Diversified | Asia          | 27
... (46 rows omitted)

In [ ]:
b_and_c = billionaires.join('citizenship', countries, 'Country')
b_and_c

In [ ]:
b_and_c.pivot('Continent', 'industry')

In [ ]:
b_and_c.group(['Continent', 'industry'])

##### What is the average net worth of the billionaries in each specific industry and Continent?

In [ ]:
b_and_c.labels

In [ ]:
# tbl.pivot(col1, col2, values, collect)
b_and_c.pivot('Continent', 'industry', 'net worth', np.average)

##### What is the range of net worths of the billionaries in each specific industry and Continent?

In [ ]:
def range(x):
    return ...

# Comparison

In [ ]:
x = 2
y = 3
x, y

In [ ]:
x > 1

In [ ]:
2 > 1

In [ ]:
x > y

In [ ]:
y >= 3

In [ ]:
x == y

In [ ]:
x != 2

In [ ]:
2 != 2

In [ ]:
2 < x < 5

In [ ]:
-1 * x < -1 * y

### Comparing strings

What do we think `"dog" > "cat"` will return?

In [ ]:
"dog" > "cat"

In [ ]:
"zack" > "adam"

In [ ]:
"cat" < "dog"

Why is this the case?

What about strings that start the same?

In [ ]:
"dogma" > "dog"

### Comparisions to arrays

In [ ]:
range_between_one_twenty = np.arange(1, 20)
range_between_one_twenty

In [ ]:
range_between_one_twenty * 2

In [ ]:
range_between_one_twenty > 2

back to slides

### Combining comparisons

In [ ]:
a = True
b = False
a, b

In [ ]:
a or b

In [ ]:
not a, not b

In [ ]:

#True and (not False)
#True and True
a and not b

In [ ]:
x, y

In [ ]:
x > 2 or y > 2

In [ ]:
x > 2 and y > 2

In [ ]:
not (x > 2 or y > 2)

back to slides
### Aggregating Comparisons

In [ ]:
range_between_one_twenty

In [ ]:
6 % 2 == 0

Lets find the number of values that are even

In [ ]:
# Lets first make a function that tells us if a number is even
def is_even(x):
    """ Converts numbers into bool based on whether the number is even or odd
    """
    return x % 2 == 0

Let's test if this function works:

In [ ]:
is_even(2), is_even(5), is_even(-4)

Now let's apply this function to our array (either make a new table and use `apply` or pass it to our function)

In [ ]:
t = Table().with_columns('number', range_between_one_twenty)
t = t.with_columns('is_even', t.apply(is_even, 'number'))
t

Now how many of these numbers are even?

In [ ]:
sum(t.column('is_even'))

back to slides

# Control Statements

In [ ]:
def sign(x):
    '''
    Returns "positive", "negative", "zero" depending on the value of x
    Adam: only use if's
    '''
    return_string = ""
    ...
    return return_string

In [ ]:
sign(10), sign(-10), sign(0)

### `if`, `elif`, and `else`

In [ ]:
def sign(x):
    '''
    Returns "positive", "negative", "zero" depending on the value of x
    '''

### `abs()`
Now try implementing the `abs()` function

In [ ]:
help(abs)

In [ ]:
def abs(x):
    ...

# Random Selection

In [ ]:
groups = make_array('treatment', 'control')
groups

Let's randomly assign 1 individual to each group

Let's randomly assign 5 individuals to each group

Let's repeat this

Do we see any differences?

So now let's store the outcome

back to slides
# `np.append()`
Manually grow an empty array to [0,...,8] one element at a time

back to slides
# `For` Statements

In [ ]:
for i in np.arange(4):
    print('iteration', i)

Use a for loop to grow the array `t`

In [ ]:
# Initialize Otter
import otter
grader = otter.Notebook()
grader.export("Lecture_8_completed.ipynb", pdf=False)